tap 'homebrew/cask'
tap 'warrensbox/tap'

brew 'age'
brew 'atuin'
brew 'awscli'
brew 'chezmoi'
brew 'coreutils'
brew 'direnv'
brew 'findutils'
brew 'gawk'
brew 'git'
brew 'gnu-getopt'
brew 'gnu-sed'
brew 'gnu-tar'
brew 'gnu-time'
brew 'gnutls'
brew 'go'
brew 'gomplate'
brew 'helmfile'
brew 'jq'
brew 'k9s'
brew 'kubectx'
brew 'mas'
brew 'pyenv'
brew 'pyenv-virtualenvwrapper'
brew 'rbenv'
brew 'ripgrep'
brew 'tfswitch'
brew 'tmux'
brew 'vim'
brew 'volta'
brew 'watch'
brew 'yq'
brew 'zsh'

cask 'authy'
cask 'brave-browser'
cask 'discord'
cask 'docker'
cask 'drawio'
cask 'iterm2'
cask 'postman'
cask 'rectangle'
cask 'slack'
cask 'visual-studio-code'
cask 'zoom'
