brew 'age'
brew 'atuin'
brew 'awscli'
brew 'coreutils'
brew 'direnv'
brew 'findutils'
brew 'gawk'
brew 'git'
brew 'gitui'
brew 'gnu-getopt'
brew 'gnu-sed'
brew 'gnu-tar'
brew 'gnu-time'
brew 'gnutls'
brew 'go'
brew 'gomplate'
brew 'grep'
brew 'helm'
brew 'helmfile'
brew 'jq'
brew 'just'
brew 'k9s'
brew 'kubectx'
brew 'kubernetes-cli'
brew 'pyenv'
brew 'pipx'
brew 'rbenv'
brew 'ripgrep'
brew 'telepresenceio/telepresence/telepresence-oss'
brew 'tree'
brew 'volta'
brew 'warrensbox/tap/tfswitch'
brew 'watch'
brew 'yq'
brew 'zsh'

# term mulitplex, editors, language servers, and formatters
brew 'zellij'
brew 'helix'
brew 'shellcheck'
brew 'taplo'
brew 'helm-ls'
brew 'hashicorp/tap/terraform-ls'

# casks (apps)
cask 'discord'
cask 'docker'
cask 'drawio'
cask 'wezterm'
cask 'postman'
cask 'rectangle'
cask 'slack'
cask 'visual-studio-code'
cask 'zoom'
